Дошкольное_учреждение83/src/Documents/удуУвольнениеИзОрганизаций/удуУвольнениеИзОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуУвольнениеИзОрганизаций</name>
  <registerRecords>AccumulationRegister.удуЗанятыеШтатныеЕдиницыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.удуФактическиеОтпускаОрганизаций</registerRecords>
  <registerRecords>InformationRegister.удуРаботникиОрганизаций</registerRecords>
  <registerRecords>InformationRegister.удуПериодыРаботыРаботниковОрганизацийПоСовместительству</registerRecords>
  <registerRecords>InformationRegister.удуПлановыеНачисленияРаботниковОрганизаций</registerRecords>
  <registerRecords>InformationRegister.удуПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботникиОрганизации</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.удуСотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяТКРФ</name>
      <type>
        <types>CatalogRef.удуОснованияУвольненияИзОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеУвольнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочийГодС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РабочийГодПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейЧасовКомпенсацииУдержанияОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакКомпенсацииОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокРасчетаОтпуска</name>
      <type>
        <types>EnumRef.удуПорядокРасчетаОтпуска</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/Enums/удуВидыДоговоровСФизЛицами/удуВидыДоговоровСФизЛицами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыДоговоровСФизЛицами</name>
  <enumValues>
    <name>ТрудовойДоговор</name>
  </enumValues>
  <enumValues>
    <name>Подряда</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуСотрудникиОрганизаций/удуСотрудникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуСотрудникиОрганизаций</name>
  <basedOn>Catalog.ФизическиеЛица</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.удуВидыДоговоровСФизЛицами</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятости</name>
    <type>
      <types>EnumRef.удуВидыЗанятостиВОрганизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.удуПодразделенияУчереждения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспытательныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.удуОсновныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостфиксНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Documents/удуУвольнениеИзОрганизаций/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем АдресВХранилище;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработатьПодбор() Экспорт
	
	Сотрудник=ПолучитьИзХранилища(АдресВХранилище);
	Если ЗначениеЗаполнено(Сотрудник) тогда
		СтрокиРаботников = Объект.РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник));
		Если СтрокиРаботников.Количество() > 0 Тогда
			Предупреждение("В данном документе по одному сотруднику можно вводить только одну строку!");
			Возврат;
		КонецЕсли;
		СтрокаТЧ=Объект.РаботникиОрганизации.Добавить();
		Модифицированность=Истина;
		СтрокаТЧ.Сотрудник=Сотрудник;
		СтрокаТЧ.ДатаУвольнения = ТекущаяДата();
		ЗаполнитьСтрокиДопЗначениями(СтрокаТЧ.ПолучитьИдентификатор());
		мТекущийСотрудник = СтрокаТЧ.Сотрудник;	
	КонецЕсли;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПоместитьВХранилище(ДанныеДляХранилища=Неопределено)
	
	ДанныеДляХранилища=?(ДанныеДляХранилища=Неопределено,Справочники.удуСотрудникиОрганизаций.ПустаяСсылка(),ДанныеДляХранилища);
	Возврат ПоместитьВоВременноеХранилище(ДанныеДляХранилища, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция ПолучитьИзХранилища(АдресВХранилище)
	
	Возврат ПолучитьИзВременногоХранилища(АдресВХранилище);
		
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокиДопЗначениями(Индекс=Неопределено)

	Если Индекс=Неопределено тогда
		Для Каждого СтрокаТЧ из Объект.РаботникиОрганизации цикл
			ЗаполнитьСтрокиДопЗначениями(СтрокаТЧ.ПолучитьИдентификатор());
		КонецЦикла;
	Иначе 	
		Объект.РаботникиОрганизации.НайтиПоИдентификатору(Индекс).ФизЛицо=Объект.РаботникиОрганизации.НайтиПоИдентификатору(Индекс).Сотрудник.ФизЛицо;
	КонецЕсли;
 
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокФормыДокументаСервер()
	
	 удуОбщегоНазначенияСервер.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	
 КонецПроцедуры

&НаСервере
Процедура ПриОткрытииСервер()
	
  мТекущийСотрудник	= удуОбщегоНазначенияСервер.ПустоеЗначениеТипа("СправочникСсылка.удуСотрудникиОрганизаций");
  
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	удуОбщегоНазначенияСервер.ПроверитьНомерДокумента(Объект, мТекущаяДатаДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораСервер(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Команда = "";
		Если ВыбранноеЗначение.Свойство("Команда",Команда) и Команда = "ЗаполнитьСписокРаботников" Тогда
			СписокРаботников=ПолучитьИзХранилища(ВыбранноеЗначение.АдресДанных);
			СписокРаботников.Колонки.Добавить("ДатаУвольнения");
			СписокРаботников.ЗаполнитьЗначения(ТекущаяДата(), "ДатаУвольнения"); 
			Объект.РаботникиОрганизации.Загрузить(СписокРаботников);
			ЗаполнитьСтрокиДопЗначениями();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

 &НаСервере
Функция ПолучитьВидДоговора()
	
	Возврат Перечисления.удуВидыДоговоровСФизЛицами.ТрудовойДоговор;
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.АдресВХранилище) тогда
		 ОбъектИзХранилища=ПолучитьИзХранилища(Параметры.АдресВХранилище);
		 ЗначениеВДанныеФормы(ОбъектИзХранилища,Объект);
	 КонецЕсли;

	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		удуДокументыКадровогоУчета.ЗаполнитьШапкуДокумента(Объект);
	КонецЕсли;

КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЗаголовокФормыДокументаСервер();	
  мТекущаяДатаДокумента	= Объект.Дата;

  ПриОткрытииСервер();
  
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбработкаВыбораСервер(ВыбранноеЗначение);
	Модифицированность=Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьЗаголовокФормыДокументаСервер();
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьСпискомСотрудников(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Предупреждение("Не указана организация, отобрать список сотрудников невозможно!");
		Возврат;
	КонецЕсли;
	
	Если Объект.РаботникиОрганизации.Количество() > 0 Тогда
		ТекстВопроса = "Перед заполнением табличные части будут очищены. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;

	КонецЕсли;
	
	
	Структура=Новый Структура;
	Структура.Вставить("ДатаАктуальности",Объект.Дата);
    Структура.Вставить("Организация",Объект.Организация);	
	
	
	
	АдресВХранилище = ПоместитьВХранилище(Структура);
	ПараметрыФормы = Новый Структура("АдресДанныхНачальногоЗаполнения", АдресВХранилище);
	ФормаОтбора = ПолучитьФорму("Обработка.удуФормированиеСпискаРаботников.Форма.ФормаНастройки",ПараметрыФормы,ЭтаФорма);
	ФормаОтбора.ОткрытьМодально();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресВХранилище = ПоместитьВХранилище();
	ПараметрыПодбора = Новый Структура("ЭтоПодбор,АдресПодбора,ДатаСреза,НеПоказыватьУволенных,ВидДоговора", Истина, АдресВХранилище,Объект.Дата,Истина,ПолучитьВидДоговора());	
	ОткрытьФорму("Справочник.удуСотрудникиОрганизаций.Форма.ФормаСписка",ПараметрыПодбора ,ЭтаФорма);
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииСервер();
	мТекущаяДатаДокумента = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер="";
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ РаботникиОрганизации



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ТАБЛИЧНОГО ПОЛЯ РаботникиОрганизации

&НаКлиенте
Процедура РаботникиОрганизацииСотрудникПриИзменении(Элемент)
	
	СтрокаТЧ=Элементы.РаботникиОрганизации.ТекущиеДанные;
	Если не ЗначениеЗаполнено(СтрокаТЧ.ДатаУвольнения) тогда
		СтрокаТЧ.ДатаУвольнения = ТекущаяДата();
	КонецЕсли;
	ЗаполнитьСтрокиДопЗначениями(Элементы.РаботникиОрганизации.ТекущаяСтрока);
	мТекущийСотрудник=Элементы.РаботникиОрганизации.ТекущиеДанные.Сотрудник;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыПодбора = Новый Структура("ДляВыбора,ДатаСреза,НеПоказыватьУволенных,ВидДоговора", Истина,Объект.Дата,Истина,ПолучитьВидДоговора());
	СтандартнаяОбработка=Ложь;
	ОткрытьФорму("Справочник.удуСотрудникиОрганизаций.Форма.ФормаСписка",ПараметрыПодбора ,Элемент);

КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииСотрудникОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокиРаботников = Объект.РаботникиОрганизации.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение));
	СтрокаТЧ=Элементы.РаботникиОрганизации.ТекущиеДанные;
	Если СтрокиРаботников.Количество() > 0 и СтрокаТЧ.Сотрудник <> ВыбранноеЗначение Тогда
		Предупреждение("В данном документе по одному сотруднику можно вводить только одну строку!");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РаботникиОрганизацииДатаУвольненияПриИзменении(Элемент)
	
	СтрокаТЧ=Элементы.РаботникиОрганизации.ТекущиеДанные;
	СтрокаТЧ.РабочийГодПо=СтрокаТЧ.ДатаУвольнения;
	
КонецПроцедуры
